/*
 * analog_bloks.h
 *
 *  Created on: Jun 20, 2024
 *      Author: dexp
 */

#ifndef INC_ANALOG_BLOKS_H_
#define INC_ANALOG_BLOKS_H_

#include "stm32f1xx_hal.h"
#include "utils.h"

//=================================================
// Delay_On
//=================================================
/**
 * Структура sDelay на включение
 */
typedef struct
{
 uint16_t   bIN; ///< Адрес Coil входного сигнала
 uint16_t  bOUT; ///< Адрес Coil выходного сигнала
 uint16_t delay; ///< Задержка в 0.1 мс
 uint16_t count; ///< Счетчик проходов кратность  1 в 0.1 мс
} sDelay;

//=================================================
// Threshold
//=================================================
/**
 * Структура sThreshold на включение/выключение
 */
typedef struct{
  int16_t Out_On;   ///< порог включения
  int16_t Out_Off;  ///< порог выключения
  int16_t IN;       ///< адрес MODBUS_REG входного сигнала
  int16_t bOut;     ///< адрес COIL входного сигнала
} sThreshold;

//=================================================
// Limiter
//=================================================
/**
 * Структура sLimiter ограничение входного сигнала
 */
typedef struct{
  int16_t Out_Hi; ///< верхний ограничитель выходного сигнала
  int16_t Out_Lo; ///< нижний ограничитель выходного сигнала
  int16_t IN;     ///< адрес MODBUS_REG входного сигнала
  int16_t Out;    ///< адрес MODBUS_REG выходного сигнала
} sLimiter;

//=================================================
// Holder
//=================================================
/**
 * Структура sHolder  фиксации сигнала на выходе
 */
typedef struct{
  int16_t bOn;  ///< адрес COIL фиксации сигнала
  int16_t IN;   ///< адрес MODBUS_REG входного сигнала
  int16_t Out;  ///< адрес MODBUS_REG выходного сигнала
} sHolder;

//=================================================
// Switcher
//=================================================
/**
 * Структура sSwitcher аналоговый коммутатор
 */
typedef struct{
  int16_t IN1; ///< адрес MODBUS_REG входного сигнала 1
  int16_t IN2; ///< адрес MODBUS_REG входного сигнала 2
  int16_t bOn; ///< адрес COIL переключения сигнала
  int16_t Out; ///< адрес MODBUS_REG выходного сигнала
} sSwitcher;

//=================================================
// Ventil_Analog_2
//=================================================
/**
 * Структура sVent_Analog_2 блок на два аналоговых входа и аналоговый выход
 */
typedef struct{
  int16_t IN1;  ///< адрес MODBUS_REG входного сигнала 1
  int16_t IN2;  ///< адрес MODBUS_REG входного сигнала 2
  int16_t bOn;  ///< адрес COIL переключения сигнала
  int16_t Out;  ///< адрес MODBUS_REG выходного сигнала
  int16_t bOut; ///< адрес COIL выходного сигнала
} sVent_Analog_2;

//=================================================
// Counter
//=================================================
/**
 * Структура sCounter счетчика
 */
typedef struct{
  int16_t bClock;     ///< адрес COIL тактовый сигнал
  int16_t bClock_old; ///< предыдущее значение тактового сигнала
  int16_t bUp;        ///< адрес COIL счет вверх
  int16_t bReset;  ///< адрес COIL сброса
  int16_t Out;     ///< адрес MODBUS_REG выходного сигнала
} sCounter;

//=================================================
//        Scheduler
//         --------
// Start --|      |
//         |      |
// Time  --|      |--Out
//         |      |
// Stop  --|______|
//
//=================================================
/**
 * Структура sScheduler рабочее время
 */
typedef struct{
  int16_t IN_Start; ///< адрес MODBUS_REG(0x40) время старта
  int16_t IN_Stop;  ///< адрес MODBUS_REG(0x41) время останова
  int16_t IN_Time;  ///< адрес MODBUS_REG(0x45) текущее время
  int16_t Out;      ///< адрес COIL выходного сигнала
} sScheduler;

//=================================================
// Comparator
//=================================================
/**
 * Структура sComparator_2 сравнения двух входов
 */
typedef struct{
  int16_t IN1;  ///< адрес MODBUS_REG сравниваемое А
  int16_t IN2;  ///< адрес MODBUS_REG сравниваемое В
  int16_t bOut; ///< адрес Coil выходной сигнал
} sComparator_2;

//=================================================

//=================================================
// Comparator
//=================================================
/**
 * Структура sComparator_3 сравнения двух входов на больше меньше и равно при дельте
 */
typedef struct{
  int16_t IN1;  ///< адрес MODBUS_REG сравниваемое А
  int16_t IN2;  ///< адрес MODBUS_REG сравниваемое В
  int16_t delta;  ///< значение дельта
  int16_t bOut_GT; ///< адрес Coil выходной сигнал A > (B+delta)
  int16_t bOut_EQ; ///< адрес Coil выходной сигнал A = (B +- delta)
  int16_t bOut_LT; ///< адрес Coil выходной сигнал A < (B - delta)
} sComparator_3;

//=================================================
// Delta
// если А отличается от В больше чем на дельта, то выход = 1
//=================================================
/**
 * Структура sDelta_2 описывает расхождение двух сигналов
 */
typedef struct{
  int16_t IN1;   ///< адрес MODBUS_REG сравниваемое А
  int16_t IN2;   ///< адрес MODBUS_REG сравниваемое B
  int16_t delta; ///< предельная разница между входами А и В
  int16_t bOut;  ///< адрес Coil выходной сигнал
} sDelta_2;

//=================================================
// Regulator_1
// Регулятор 1
//
// Reverce = 0 if(Y_OC > SetPoint) Y++;
//=================================================
typedef struct{
  int16_t SetPoint;  // REG  AI
  int16_t PI;        // REG  AI
  int16_t TI;        // REG  AI
  int16_t Threshold;//SetDelta_Y; // REG AI зона нечуствительности Threhold
  int16_t Time;       // REG AI

  int16_t Y_OC;       // REG
  int16_t Reverce;  // Coil
  int16_t Enable;   // Coil
  int16_t Reset;    // Coil сброс регулятора в минимум

  int16_t Max;        // int
  int16_t Min;        // int

  int16_t I;         // REG  AI  регистр где хранится накопленая ошибка I += (SetPoint - Y_OC) * dT

  int16_t deltaY;     // REG изменение сигнала управления
  int16_t Y;          // REG сигнал управления

} sRegulator_1;

//=================================================

//=================================================
// Regulator_4
// Регулятор 4
//
// С задаваемым минимальным   улом открытия REG_AI  максимальным = 100%
// Reverce = 0 if(Y_OC > SetPoint) Y++;
//=================================================
typedef struct{
  int16_t SetPoint;  // REG  AI
  int16_t PI;        // REG  AI
  int16_t TI;        // REG  AI
  int16_t Threshold;//SetDelta_Y; // REG AI зона нечуствительности Threhold
  int16_t Time;       // REG AI

  int16_t Y_OC;       // REG
  int16_t Reverce;  // Coil
  int16_t Enable;   // Coil
  int16_t Reset;    // Coil сброс регулятора в минимум

  int16_t Max;        // int
  int16_t Min;        // REG  AI

  int16_t I;         // REG  AI  регистр где хранится накопленая ошибка I += (SetPoint - Y_OC) * dT

  int16_t deltaY;     // REG изменение сигнала управления
  int16_t Y;          // REG сигнал управления

} sRegulator_5;

//=================================================


// Regulator_Step
// Регулятор шаговый
//
// Reverce = 0 if(Y_OC > SetPoint) dY = 1;
//             else  dY = -1;
//=================================================
typedef struct{
  int16_t SetPoint;  // REG  AI
  int16_t Threshold; //SetDelta_Y; // REG AI зона нечуствительности Threhold
  int16_t Y_OC;       // REG
  int16_t Reverce;  // Coil
  int16_t Enable;   // Coil

  int16_t dY;     // REG изменение сигнала управления +1 / 0 / -1

} sRegulator_step;

//=================================================

//=================================================
// Counter_2IN
// счетчик сдвумя входами
//
//=================================================
typedef struct{
  int16_t IN1;        // REG  AI
  int16_t IN2;        // REG  AI
  int16_t Time;       // REG AI  интрвал времени через которое происходит изменение счетчика

  int16_t Reset;    // Coil сброс счетчика в минимум

  int16_t Max;        // int
  int16_t Min;        // int

  int16_t Y;          // REG  накопленый сигнал управления

} sCounter_2IN;

//=================================================


//=================================================
// MUX_4
//=================================================
/**
 * Структура sMUX_4 аналоговый ключ на 4 входа
 */
typedef struct{
  int16_t IN1;  ///< вход  адрес MODBUS_REG сравниваемое 1
  int16_t IN2;  ///< вход  адрес MODBUS_REG сравниваемое 2
  int16_t IN3;  ///< вход  адрес MODBUS_REG сравниваемое 3
  int16_t IN4;  ///< вход  адрес MODBUS_REG сравниваемое 4
  int16_t ADR;  ///< вход  адрес MODBUS_REG адрес выбора
  int16_t Out;  ///< адрес MODBUS_REG выход
} sMUX_4;

//=================================================
// sMUX_dig_4
// цифровой мультиплексор  на цифровых 4 входа
//=================================================
/**
 * Структура sMUX_dig_4 цифровой мультиплексор  на цифровых 4 входа
 */
typedef struct{
  int16_t IN1;  ///<адрес Coil  вход 1
  int16_t IN2;  ///<адрес Coil  вход 2
  int16_t IN3;  ///<адрес Coil  вход 3
  int16_t IN4;  ///<адрес Coil  вход 4
  int16_t ADR;  ///< вход  адрес MODBUS_REG адрес выбора
  int16_t Out;  ///<адрес Coil  выход
} sMUX_dig_4;

//=================================================
// sDeCoder_4
// декодер на 4 цифровых выхода
//=================================================
/**
 * Структура sDeCoder_4 декодер на 4 цыфровых выхода
 * декодирование регистра MODE в биты режима 0 - ручной, 1- лето, 2- вентиляция, 3- зима
 */
typedef struct{
  int16_t IN1;    ///< адрес MODBUS_REG регистра входного сигнала
  int16_t OUT1;   ///< адрес Coil выход 1 ручн
  int16_t OUT2;   ///< адрес Coil выход 2 лето
  int16_t OUT3;   ///< адрес Coil выход 3 вентиляция
  int16_t OUT4;   ///< адрес Coil выход 4 зима
} sDeCoder_4;

//=================================================
// sEquation
// По двум точкам строится прямая
// И по Тул выбирается тем-ра обратного теплоносителя Тоб
//
//int16_t Tout1;     // адоес Reg входного регистра уставка самая холодная тем-ра на улице
//int16_t Twater1;   // адоес Reg входного регистра уставка самая горячая тем-ра воды
//int16_t Tout2;     // адоес Reg входного регистра уставка самая теплая тем-ра на улице
//int16_t Twater2;   // адоес Reg входного регистра уставка самая холодная тем-ра воды
//
//int16_t Tout_now;  // адоес Reg входного регистра текущая тем-ра на улице
//
//int16_t OUT;   //  адоес Reg выодного регистра вычесленная необходимая тем-ра обратки
//=================================================
/**
 * Структура sEquation описывает вычисление выходного сигнала по входному сигналу
 * и двум точкам
 */
typedef struct{
	int16_t x1;    ///< адрес Reg входного регистра уставка самая холодная тем-ра на улице
	int16_t y1;   // адоес Reg входного регистра уставка самая горячая тем-ра воды
	int16_t x2;     // адоес Reg входного регистра уставка самая теплая тем-ра на улице
	int16_t y2;   // адоес Reg входного регистра уставка самая холодная тем-ра воды
	int16_t x;  // адоес Reg входного регистра текущая тем-ра на улице
	int16_t y;   //  адоес Reg выодного регистра вычесленная необходимая тем-ра обратки
} sEquation;

//=================================================
// sPWM
//=================================================
/**
 * Структура sPWM описывающим PWM
 */
typedef struct{
	uint16_t  counter;   ///<  счетчик проходов
	int16_t Period;      ///< значение периода ШИМ обычно 40 сек
	int16_t AI;          ///< адрес Reg входной сигнал 0 - 100%
	int16_t bOUT;        ///<  адрес Coil выходного сигнала PWM
} sPWM;


int16_t Inc(int16_t Y,int16_t Max);
int16_t Dec(int16_t Y, int16_t Min);

void  Delay_on(sDelay *);
void  Delay_off(sDelay *);
void  Threshold(sThreshold *);
void  Limiter(sLimiter *);
void  Holder(sHolder *);
void  Switcher(sSwitcher *);
void  Add(sVent_Analog_2 *);
void  Sub(sVent_Analog_2* );
void  Mult(sVent_Analog_2* );
void  Shift_Left(sVent_Analog_2* );
void  Shift_Right(sVent_Analog_2* );
void  Bits_AND(sVent_Analog_2* );
void  Bits_OR(sVent_Analog_2* );


void Counter(sCounter* );
void Scheduler(sScheduler* );  // Out = 1 - время рабочее; 0 - время выходное
void  Min(sVent_Analog_2*);    // определение минимального значения из двух
void  Cmp(sComparator_2* );    // сравнение двух чисел
void  Cmp_3(sComparator_3* CMP);   // сравнение двух чисел с отклонением дельта например 1 градус
void Delta(sDelta_2 *);          // если разница на входах больше дольты то выход = 1
void  Regulator_1(sRegulator_1* ); // пропорциональное регулирование с задержкой
void  Regulator_2(sRegulator_1* ); // пропорциональное регулирование с задержкой
void  Regulator_3(sRegulator_1* ); // пропорциональное регулирование с задержкой
void  Regulator_4(sRegulator_1* ); // пропорциональное регулирование с задержкой
void  Regulator_5(sRegulator_5* ); // пропорциональное регулирование с задержкой и задаваемым минимальным открытием

void  Regulator_PI(sRegulator_1* ); // регулятор ПИ
void  Regulator_Step(sRegulator_step* ); // регулятор шаговый

void Counter_2IN(sCounter_2IN* );   //счетчик с двумя входами

void  Equal(sVent_Analog_2 *);      // = 1 если два числа равны
void Mux_4(sMUX_4*);               // аналоговый ключ на 4 входа
void Mux_dig_4(sMUX_dig_4* ); // цифровой ключ на 4 входа

void  Max_4(sMUX_4* MAX);            // нахождение максимального из 4-х чисел
void  DeCoder_4(sDeCoder_4 *);       // декодирование регистра MODE в биты режима 0 - ручной, 1- лето, 2- вентиляция, 3- зима

void Equation_2_piont(sEquation *);     // Решение: Входы: Point1(Тул1, Тоб1), Point2(Тул2, Тоб2); Выход:  Туст - задаваемая уставка тем-ры

void Pwm(sPWM* );                  // формирователь ШИМ сигнала

void  Buff(sHolder* BUFF);        // Пердача содержимого вхоного регистра  int16_t в выходной регистр


#endif /* INC_ANALOG_BLOKS_H_ */
